<!doctype html>
<html lang="fi">
	<head>
		<meta charset="utf-8">
		<meta name="viewport" content="width=device-width, initial-scale=1, shrink-to-fit=no">
		<link rel="stylesheet" href="https://stackpath.bootstrapcdn.com/bootstrap/4.4.1/css/bootstrap.min.css" integrity="sha384-Vkoo8x4CGsO3+Hhxv8T/Q5PaXtkKtu6ug5TOeNV6gBiFeWPGFN9MuhOf23Q9Ifjh" crossorigin="anonymous">
		<script src="https://code.jquery.com/jquery-3.4.1.slim.min.js" integrity="sha384-J6qa4849blE2+poT4WnyKhv5vZF5SrPo0iEjwBvKU7imGFAV0wwj1yYfoRSJoZ+n" crossorigin="anonymous"></script>
		<script src="https://cdn.jsdelivr.net/npm/popper.js@1.16.0/dist/umd/popper.min.js" integrity="sha384-Q6E9RHvbIyZFJoft+2mJbHaEWldlvI9IOYy5n3zV9zzTtmI3UksdQRVvoxMfooAo" crossorigin="anonymous"></script>
		<script src="https://stackpath.bootstrapcdn.com/bootstrap/4.4.1/js/bootstrap.min.js" integrity="sha384-wfSDF2E50Y2D1uUdj0O3uMBJnjuUD4Ih7YwaYd1iqfktj0Uod8GCExl3Og8ifwB6" crossorigin="anonymous"></script>
		<link rel="stylesheet" type="text/css" href="tyyli.css">
		<title>Historiaa ja harpputyylej&auml;</title>
	</head>
  
	<body>
	
	<h1 class="display-3 text-center">Historiaa ja harpputyylej&auml;</h1>
	<br>
	
	<div class="container sticky-top">
		<nav class="navbar navbar-expand-md navbar-light bg-light">
		
			<button class="navbar-toggler" type="button" data-toggle="collapse" data-target="#collapsibleNavbar">
				<span class="navbar-toggler-icon"></span>
			</button>
			
			<div class="collapse navbar-collapse justify-content-center" id="collapsibleNavbar">
				<ul class="navbar-nav">
					<li class="nav-item px-md-4">
						<a class="nav-link" href="index.html">Etusivu</a>
					</li>
					<li class="nav-item px-md-4">
						<a class="nav-link" href="historia.html">Historiaa ja harpputyylej&auml;</a>
					</li>
					<li class="nav-item px-md-4">
						<a class="nav-link" href="linkkeja.html">Linkkej&auml; ja kirjallisuutta</a>
					</li>
					<li class="nav-item px-md-4">
						<a class="nav-link" href="tekija.html">Tietoja tekij&auml;st&auml;</a>
					</li>
				</ul>
			</div>
		</nav>
	</div>
	
	<br>
	<div class="container">
		<h3>Huuliharpun historiaa</h3>
		<p class="text-justify">Huuliharppu keksittiin ilmeisesti Saksassa 1820-luvulla. Er&auml;&auml;n teorian mukaan huuliharpun alkumuoto oli virityspilli, jota k&auml;ytettiin pianon ja urkujen virityksess&auml;. Soittimen keksij&auml;ksi on esitetty berliinil&auml;ist&auml; Christian Buschmannia, joka v&auml;itetysti patentoi Aura-nimisen huuliharppunsa vuonna 1821, mutta t&auml;st&auml; ei ole s&auml;ilynyt kirjallisia todisteita. Joka tapauksessa jo 1820- ja 1830-luvuilla monet valmistivat Saksassa ja It&auml;vallassa huuliharpun kaltaisia soittimia. My&ouml;s Yhdysvaltojen Massachusettsissa kehitettiin vapaalehdykk&auml;&auml;n perustunut virityspilli jo 1820-luvulla. Vuosisadan alkupuolella yleistyneet mundaeolinet ja aeolinat olivat er&auml;&auml;nlaisia huuliharpun luurankoja, joiden pohjalta soitin kehittyi nykyiseen muotoonsa. Huuliharpun erityisluonteeseen vaikutti ainakin kansilevyjen keksiminen. Se esti sormia ja huulia sotkemasta kielten vapaata liikett&auml; sek&auml; mahdollisti huuliharpun sulkemisen k&auml;sien v&auml;liin ja erilaiset k&auml;siefektit. Huuliharppujen massatuotanto alkoi 1830-luvun vaihteessa It&auml;vallassa, Sveitsiss&auml; ja Saksassa. Vanhin edelleen toiminnassa oleva huuliharpputehdas on C. A. Seydelin vuonna 1847 Klingenthalissa aloittanut tehdas.<br>
		<br>Huuliharpusta tuli nopeasti Keski-Euroopassa suosittu soitin. Sen metallinen &auml;&auml;ni kantautui pitk&auml;lle ja kuulosti erikoiselta vanhoihin soittimiin verrattuna. Sen yksinkertaista mekanismia saattoi soveltaa monenlaisiin rakenteisiin ja malleihin. Huuliharppu pysyi my&ouml;s pitk&auml;&auml;n vireess&auml;, se ei vaatinut paljon huoltoa, se oli halpa, ja se kulki helposti mukana.</p>
		<br>
		<h3>Erilaisia harpputyylej&auml;</h3>
		<br>
		<div class="row">
			<div class="col-lg-4">
				<img src="diatoninen.jpg" class="img-fluid rounded mb-2" alt="Diatoninen bluesharppu">
			</div>
			<div class="col-lg-8">
				<h3>Diatoninen bluesharppu</h3>
				<p class="text-justify">Diatoninen huuliharppu on sidottu m&auml;&auml;r&auml;ttyyn diatoniseen s&auml;velasteikkoon. Jokainen harppu on viritetty tiettyyn s&auml;vellajiin, joka voi olla mik&auml; tahansa kaikista 12 s&auml;vellajista matalasta G:st&auml; korkeaan F:&auml;&auml;n. Lis&auml;ksi on olemassa esimerkiksi molliviritteisi&auml;, erikoismatalia ja -korkeita sek&auml; soolo- ja countryviritteisi&auml; harppuja.</p>
			</div>
		</div>
		<br>
		<div class="row">
			<div class="col-lg-4">
				<img src="kromaattinen.jpg" class="img-fluid img-thumbnail rounded mb-2" alt="Kromaattinen harppu">
			</div>
			<div class="col-lg-8">
				<h3>Kromaattinen huuliharppu</h3>
				<p class="text-justify">Kromaattisella huuliharpulla saadaan enemm&auml;n s&auml;veli&auml; kuin diatonisella. Siin&auml; on yleens&auml; kahdestatoista kuuteentoista ilmakanavaa, ja yht&auml; ilmakanavaa kohti on nelj&auml; kielt&auml;. Harpun oikeassa p&auml;&auml;ss&auml; olevasta vaihtajamekanismin nupista vaihdetaan yhdest&auml; rei&auml;st&auml; saatavia s&auml;veli&auml; ohjaamalla kieli joko yl&auml;- tai alakielilaatalle.</p>
			</div>
			
		</div>
		<br>
		<div class="row">
			<div class="col-lg-4">
				<img src="tremolo.jpg" class="img-fluid img-thumbnail rounded mb-2" alt="Tremoloharppu">
			</div>
			<div class="col-lg-8">
				<h3>Tremolo- ja oktaavihuuliharppu</h3>
				<p class="text-justify">Parikielisess&auml; huuliharpussa yht&auml; s&auml;velt&auml; tuottaa samanaikaisesti kaksi soivaa kielt&auml;. Parikielisi&auml; huuliharppuja on tremolovireisi&auml; ja oktaavivireisi&auml;. Tremoloviritetyss&auml; harpussa samanaikaisesti soivat kielet ovat hieman eri vireisi&auml;, mik&auml; tuottaa tremoloefektin. Oktaavivireisess&auml; huuliharpussa alemman rei&auml;n kieli on viritetty oktaavia korkeammalle kuin ylemm&auml;n, mik&auml; tuottaa yksirivisen haitarin oktaavi&auml;&auml;nikertaa muistuttavan &auml;&auml;nen.</p>
			</div>
		</div>
		<br>
		<div class="row">
			<div class="col-lg-4">
				<img src="bassoharppu.jpg" class="img-fluid img-thumbnail rounded mb-2" alt="Bassohuuliharppu">
			</div>
			<div class="col-lg-8">
				<h3>Bassohuuliharppu</h3>
				<p class="text-justify">Bassohuuliharppua soitetaan ainoastaan puhaltamalla. Sen &auml;&auml;net on sijoitettu kahteen p&auml;&auml;llekk&auml;iseen runkoon, ja s&auml;velkorkeuden tuottaa kaksi samanaikaisesti soivaa kielt&auml;. Soittimessa on tyypillinen resonanssi, joka syntyy oktaavin v&auml;lein viritetyist&auml; parikielist&auml;. Korva kuulee soivana s&auml;velkorkeutena alemman kielen tuottaman korkeuden</p>
			</div>
			
		</div>
		<br>
		<div class="row">
			<div class="col-lg-4">
				<img src="sointuharppu.jpg" class="img-fluid img-thumbnail rounded mb-2" alt="Sointuhuuliharppu">
			</div>
			<div class="col-lg-8">
				<h3>Sointuhuuliharppu</h3>
				<p class="text-justify">Pitk&auml; sointuhuuliharppu koostuu useista soinnuista, jotka saadaan soittamalla sit&auml; eri paikoista imuin ja puhalluksin. Joissain malleissa harppu jakautuu kahteen saranalla toisiinsa liittyv&auml;&auml;n p&auml;&auml;llekk&auml;iseen osaan. Esimerkiksi Hohnerin Chord 48:lla pystyy soittamaan 48 erilaista sointua sis&auml;lt&auml;en duuri, mollit, duurien ylinousevat, v&auml;hennetys ja seiskasoinnut.</p>
			</div>
		</div>
	</div>
	<br>
	<br>
	<br>
	<div class="container">
		<footer>
			<div class="text-center">
				<p class="footer">&copy; Janne Lahdenper&auml; 2020</p>
			</div>
		</footer>
	</div>
	
	</body>
   
</html>